# 나이를 저장 할 변수를 선언하고 숫자를 대입하세요
age = 30
# 나이가 40세 이하일때 true가 나오도록 조건식을 작성하세요
print(age <= 40)

# 소지금을 저장 할 변수를 선언하고 숫자를 대입하세요
money = 5000
# 내가 가진돈이 2000원 이상이면 true가 나오도록 조건식을 작성하세요
print(money >= 2000)

# 비밀번호를 저장 할 변수를 선언하고 문자를 대입하세요
password = 1234
# 비밀번호가 "1234" 아닐 때 true가 나오도록 조건식을 작성하세요
print(password != 2412)

# 변수를 선언하고 숫자를 대입하세요
number = 10

# 숫자가 짝수라면 true가 나오도록 조건식을 작성하세요
# 숫자가 짝수라면?
# 짝수 홀수 배수 => 나머지 연산자 %
# 배수 => % 특정숫자
# 2로 나머지 값을 구했읃떄 0이 나오면 짝수
# 1이 나오면 홀수
print(number % 2) # 0
# 나머지 값
mod = number % 2

print(mod == 0) # true

# 변수 == 값
# 식 == 값
print((number % 2) == 0)
